Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl
The Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl class represents a control that can be used to display or edit unformatted text.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.internalControl
The internal control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.#ctor(System.String,System.Drawing.Image)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl class.
text: The text.
image: The image.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.Title
Sets the title of the control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.GotKeyboardFocus
Event to be taken when the control has gotten keyboard focus.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.LostKeyboardFocus
Event to be taken when the control has lost keyboard focus.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.StateChanged
Event to be called when the state of the control has changed.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.InternalControl


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.OnGotKeyboardFocus(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the got keyboard focus event.
control: The control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.OnLostKeyboardFocus(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the lost keyboard focus event.
control: The control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.TextBoxControl.OnStateChanged(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the state changed event.
control: The control.